app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Thu, 27 Jun 2013 15:44:14 UTC +00:00], ["title", ""], ["updated_at", Thu, 27 Jun 2013 15:44:14 UTC +00:00]]
---
    def create
        @article = Article.new
        @article.title = params[:article][:title]
        @article.body = params[:article][:body]
        @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "articles" SET "body" = 'nbkirlkabra', "updated_at" = '2013-06-27 21:39:48.814948' WHERE "articles"."id" = 1
---
    def update
        @article = Article.find(params[:id])
        @article.update_attributes(params[:article])