app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 18], ["author_name", "hi"], ["body", "hi"], ["created_at", Mon, 01 Jul 2013 18:11:28 UTC +00:00], ["updated_at", Mon, 01 Jul 2013 18:11:28 UTC +00:00]]
---
    def create
        @comment = Comment.new(params[:comment])
        @comment.article_id = params[:article_id]

        @comment.save